
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/Sadan007/aws-ecs-terraform/actions/runs/10418116493)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0a726dad91e2c9a43]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-058c61c0fe3f48cc1]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0c5d11a0a677e1b4c]
aws_security_group.ecs: Refreshing state... [id=sg-018a893363feab386]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-06732e9368ffd743d]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b968489362f876c0]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:targetgroup/go-simple-server-target-group/b3e2b4cb85745bb1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-060b91e1c5ec3e65f]
aws_security_group.alb: Refreshing state... [id=sg-0ff7655b17cc3a3f9]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ecedb81531f5bfb9]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0c67bfda6fb6fef21]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08282f6d6e0448d3c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c3f91372e6601353]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05837b8127ff91859]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-041c0425ad133aefd]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0633b7623b84469b2]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0257f5d9e381fad51]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1024711945]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0c67bfda6fb6fef211080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c0ae7c419713d251]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-03b25e371661fca6f]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:loadbalancer/app/go-simple-server-alb/c249f93de79a7960]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e6b3e2e7e6b89e60]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0763d8082241fe266]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0b827f5e0430e0560]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-03f5b332d6628447c]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-06732e9368ffd743d1080289494]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0b968489362f876c01080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener/app/go-simple-server-alb/c249f93de79a7960/01c35c30ac2e05aa]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:222433988246:listener-rule/app/go-simple-server-alb/c249f93de79a7960/01c35c30ac2e05aa/21979f97dfd80197]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_lifecycle_policy.ecr_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "ecr_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 30 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 30
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "go-simple-server"
    }

  # aws_ecr_repository.ecr_repository will be created
  + resource "aws_ecr_repository" "ecr_repository" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "go-simple-server"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecr_repository.ecr_repository: Creating...
aws_ecr_repository.ecr_repository: Creation complete after 1s [id=go-simple-server]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creating...
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Creation complete after 0s [id=go-simple-server]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":18,"Program":"tfcmt","SHA1":"d9c9663ebc9f8bd2f06e54e5fd99415dafa0bc02","Vars":{},"WorkflowName":"Terraform"} -->